tap "codecrafters-io/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "stripe/stripe-cli"
tap "thezoraiz/ascii-image-converter"
brew "act"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "btop"
brew "glib"
brew "python@3.12"
brew "cairo"
brew "dos2unix"
brew "unbound"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "ghostscript"
brew "git-delta"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "k6"
brew "libffi"
brew "libpq", link: true
brew "neovim"
brew "nmap"
brew "pipx"
brew "qpdf"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "wimlib"
brew "zbar"
brew "zoxide"
brew "codecrafters-io/tap/codecrafters"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "stripe/stripe-cli/stripe"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "orbstack"
cask "raycast"
cask "warp"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jabacchetta.vscode-essentials"
vscode "kevinrose.vsc-python-indent"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rocketseat.theme-omni"
vscode "rvest.vs-code-prettier-eslint"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wmaurer.vscode-jumpy"
vscode "yoavbls.pretty-ts-errors"
vscode "zhang-renyang.vscode-react"
