tap "homebrew/bundle"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Portable Foreign Function Interface library
brew "libffi"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Port scanning utility for large networks
brew "nmap"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jabacchetta.vscode-essentials"
vscode "kevinrose.vsc-python-indent"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "rocketseat.theme-omni"
vscode "rvest.vs-code-prettier-eslint"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wmaurer.vscode-jumpy"
vscode "yoavbls.pretty-ts-errors"
vscode "zhang-renyang.vscode-react"
